In [10]:
import boto3
import pandas as pd
import os
from dotenv import load_dotenv
load_dotenv()

True

## Importing Data from s3 through Boto3

In [11]:
s3 = boto3.client('s3', aws_access_key_id=os.getenv('ACCESS_KEY'), aws_secret_access_key=os.getenv('SECRET_ACCESS_KEY'))

In [12]:
def get_s3_object(s3_bucket, s3_object):
    return s3.get_object(Bucket=s3_bucket, Key=s3_object)

In [13]:
data = get_s3_object("andrey-makeschooldata", "Churn_Modelling.csv")
df = pd.read_csv(data['Body'])

In [15]:
df[:5]

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

## Importing data from SQL Database

### Setup Database

In [16]:
import sqlite3 as lite
con = lite.connect('population.db')

In [17]:
with con:
    cur = con.cursor()
    cur.execute("CREATE TABLE Population(id INTEGER PRIMARY KEY, country TEXT, population INT)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Germany',81197537)")
    cur.execute("INSERT INTO Population VALUES(NULL,'France', 66415161)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Spain', 46439864)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Italy', 60795612)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Spain', 46439864)")

### Read from Database

In [21]:
query1 = "SELECT country FROM Population WHERE population > 50000000;"
df1 = pd.read_sql_query(query1, con)
df1[:5]

   country
0  Germany
1   France
2    Italy

In [22]:
query2 = "SELECT * FROM Population WHERE population > 50000000;"
df2 = pd.read_sql_query(query2, con)
df2[:5]

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   4    Italy    60795612

In [39]:
query3 = "SELECT * FROM Population WHERE country LIKE 'Sp%'"
df3 = pd.read_sql_query(query3, con)
df3

   id country  population
0   3   Spain    46439864
1   5   Spain    46439864

## Import data from MongoDB

### Setup MongoDB Database and insert document

In [32]:
from datetime import datetime
from pymongo import MongoClient

client = MongoClient()

db = client['dstutorial']
articles = db['articles']

doc1 = {
    "title": "An article about MongoDB and Python",
    "author": "Marco",
    "publication_date": datetime.utcnow(),
}

doc2 = {
    "title": "Another artile",
    "author": "Andrey",
    "publication_date": datetime.utcnow(),
}

doc_id = articles.insert_one(doc1).inserted_id
doc_id = articles.insert_one(doc2).inserted_id

print(f"Inserted doc with id: {doc_id}")

Inserted doc with id: 5f501d0853907fb89f4f8354

### Reading data from the MongoDB database

In [33]:
df = pd.DataFrame(list(articles.find()))

In [34]:
df

,_id,title,author,publication_date
0,5f501b1d53907fb89f4f834e,An article about MongoDB and Python,Marco,2020-09-02 22:22:21.874
1,5f501cfc53907fb89f4f8350,An article about MongoDB and Python,Marco,2020-09-02 22:30:20.139
2,5f501cfc53907fb89f4f8351,Another artile,Andrey,2020-09-02 22:30:20.139
3,5f501d0853907fb89f4f8353,An article about MongoDB and Python,Marco,2020-09-02 22:30:32.348
4,5f501d0853907fb89f4f8354,Another artile,Andrey,2020-09-02 22:30:32.348

In [35]:
articles_by_andrey = articles.find({'author': 'Andrey'})

In [36]:
df_by_andrey = pd.DataFrame(list(articles_by_andrey))
df_by_andrey

                        _id           title  author        publication_date
0  5f501cfc53907fb89f4f8351  Another artile  Andrey 2020-09-02 22:30:20.139
1  5f501d0853907fb89f4f8354  Another artile  Andrey 2020-09-02 22:30:32.348

## Other Activities

In [49]:
import requests
import json

In [50]:
result = requests.get("https://api.github.com/search/repositories?q=tensorflow")

In [51]:
data = json.loads(result.text)

In [55]:
items = data["items"][:10]

In [58]:
for item in items:
    print(f"name: {item['full_name']}")

name: tensorflow/tensorflow
name: romeokienzler/TensorFlow
name: aymericdamien/TensorFlow-Examples
name: czy36mengfei/tensorflow2_tutorials_chinese
name: jikexueyuanwiki/tensorflow-zh
name: jtoy/awesome-tensorflow
name: tensorflow/models
name: yao62995/tensorflow
name: lyhue1991/eat_tensorflow2_in_30_days
name: tensorflow/docs